Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/attendance_and_discipline_in_schools/child_abuse.html.txt.tmx
Source language: en
Languages: ga

source: Reporting child abuse at primary and post primary level
ga: Mí-úsáid leanaí a thuairisciú ag leibhéal na bunscoile agus na hiar-bhunscoile

source: The Department of Health published the Children First: National Guidelines for the Protection and Welfare of Children report in 1999
ga: D’fhoilsigh an Roinn Sláinte an tuarascáil dar teideal Tús Áite do Leanaí: Treoirlínte Náisiúnta um Chosaint agus Leas Leanaí sa bhliain 1999

source: In 2011, the Department of Children and Youth Affairs updated the Children First Guidelines (pdf)
ga: I 2011 cothrom le dáta an Roinn Leanaí agus Gnóthaí Óige na Treoirlínte (pfd)

source: This report stated that teachers in Ireland have a general duty to ensure that children and young people are protected from harm
ga: Deirtear sa tuarascáil sin go bhfuil dualgas i gcoitinne ar mhúinteoirí in Éirinn a chinntiú go gcosnaítear leanaí agus daoine óga ar dhochar

source: The report also maintains that teachers need to help young people to develop their self-esteem, confidence, independence of thought and the necessary skills to cope with possible threats to their personal safety both within and outside the school
ga: Dearbhaítear sa tuarascáil freisin go gcaithfidh múinteoirí cabhrú le daoine óga chun forbairt a dhéanamh ar a bhféinmheas, a muinín, a neamhspleáchas smaointe agus na scileanna is gá chun déileáil le bagairtí a d’fhéadfadh a bheith ann dá sábháilteacht phearsanta laistigh agus lasmuigh den scoil araon

source: The stay safe programme assists teachers working with children in primary school
ga: Cabhraíonn an clár ‘Bí Aireach’ le múinteoirí a oibríonn le leanaí sa bhunscoil

source: Since the publication of this report the Department of Education has published guidelines for teachers
ga: Ó foilsíodh an tuarascáil sin d’fhoilsigh an Roinn Oideachais treoirlínte do mhúinteoirí

source: These guidelines reflect the particular circumstances of primary schools, post-primary schools and community or voluntary organisations and are based on the recommendations of the Children First guidelines: Child Protection Procedures for Primary and Post-Primary Schools (pdf)
ga: Tá léiriú sna treoirlínte sin ar imthosca áirithe bunscoileanna, iar-bhunscoileanna agus eagraíochtaí pobail nó saorálacha agus tá siad bunaithe ar mholtaí de chuid na tuarascála Tús Áite do Leanaí: Nósanna Imeachta do Bhunscoileanna agus d’Iar-Bhunscoileanna chun Leanaí a Chosaint (pdf)

source: Here we summarise the principles that apply to the protection of children and the responsibilities of school management and staff
ga: Tá achoimre againn anseo ar na prionsabail a bhaineann le cosaint leanaí agus le freagrachtaí bhainistíocht agus fhoireann na scoile

source: Responsibilities of school management
ga: Freagrachtaí bhainistíocht na scoile

source: School managers in primary and post-primary schools should:
ga: Ba chóir do bhainisteoirí i mbunscoileanna agus in iar-bhunscoileanna na nithe seo a leanas a dhéanamh:

source: • Plan, develop and implement an effective child protection programme
ga: • Clár éifeachtach um chosaint leanaí a phleanáil, a fhorbairt agus a chur i ngníomh;

source: • Monitor the effectiveness of the programme
ga: • Faireachán a dhéanamh ar a éifeachtaí atá an clár

source: • Implement agreed reporting procedures
ga: • Nósanna imeachta tuairiscithe arna gcomhaontú a chur i ngníomh

source: • Plan and implement appropriate staff development and training programmes
ga: • Cláir chuí forbartha agus oiliúna foirne a phleanáil agus a chur i ngníomh

source: The Board of Management is responsible for:
ga: Tá an Bord Bainistíochta freagrach as na nithe seo a leanas:

source: • Having clear procedures which teachers and other school staff must follow where they suspect, or are alerted to, possible child abuse, including where a child discloses abuse
ga: • Nósanna imeachta soiléire a bheith i bhfeidhm nach foláir do mhúinteoirí agus d’fhoireann eile na scoile cloí leo i gcás ina mbeidh drochamhras orthu nó ina gcuirtear in iúl dóibh gur féidir go bhfuil mí-úsáid leanaí ann, lena n-áirítear i gcás ina nochtann leanbh mí-úsáid

source: • Having a Designated Liaison Person (DLP) in place for dealing with child protection concerns
ga: • Duine Caidrimh Ainmnithe (DCA) a bheith i bhfeidhm chun déileáil le buarthaí um chosaint leanaí

source: The name of the DLP should be displayed in a prominent position near the main entrance to the school
ga: Ba cheart ainm an DCA a léiriú in áit fheiceálach i ngar do phríomhbhealach isteach na scoile

source: • Monitoring the progress of children considered to be at risk
ga: • Faireachán a dhéanamh ar dhul chun cinn leanaí a meastar a bheith i mbaol

source: • Promoting in-service training for teachers and members of boards of management to ensure that they have a good working knowledge of child protection issues and procedures
ga: • Oiliúint in-seirbhíse do mhúinteoirí agus do bhaill de na boird bhainistíochta a chur chun cinn chun a chinntiú go bhfuil eolas maith reatha acu ar shaincheisteanna agus nósanna imeachta a bhaineann le cosaint leanaí;

source: • Having clear written procedures in place concerning action to be taken where allegations are made against schools employees
ga: • Nósanna imeachta soiléire i scríbhinn a bheith ar fáil maidir le bearta atá le déanamh i gcás go ndéantar líomhaintí i gcoinne fostaithe de chuid na scoile

source: • Reviewing the school’s child protection policy annually
ga: • Athbhreithniú a dhéanamh ar bheartas cosanta leanaí na scoile gach bliain

source: Personal responsibilities of school staff
ga: Freagrachtaí pearsanta fhoireann na scoile

source: • If a child tells a teacher or other member of school staff that a parent/carer or any other person is harming him/her, the person who receives the information should listen carefully and supportively
ga: • Má deir leanbh le múinteoir nó le duine eile d’fhoireann na scoile go bhfuil dochar á dhéanamh dó/di ag tuismitheoir/cúramóir nó aon duine eile, ba chóir don duine a fhaigheann an fhaisnéis éisteacht go cúramach agus ar mhodh tacúil

source: This applies where the child implies that he/she is at risk of being harmed by a parent/carer or any other person
ga: Tá an méid sin infheidhme i gcás ina dtugann an leanbh le tuiscint go bhfuil sé/sí i mbaol go ndéanfaidh tuismitheoir/cúramóir nó aon duine eile dochar dó/di

source: It also applies if a parent/carer or any other person discloses that he/she has harmed or is at risk of harming a child
ga: Tá sé infheidhme freisin i gcás ina nochtann tuismitheoir/cúramóir nó aon duine eile go ndearna sé/sí dochar do leanbh nó go bhfuil sé/sí i mbaol dochar a dhéanamh do leanbh

source: • The child or young person should not be interviewed formally
ga: • Ní cóir an leanbh nó an duine óg a chur faoi agallamh foirmiúil;

source: • The teacher or staff member should obtain only the necessary relevant facts
ga: • Ní cóir don mhúinteoir nó don duine den fhoireann ach amháin na fíorais is gá a fháil

source: • The teacher or staff member should never promise confidentiality to a person making a disclosure and should explain why they are required to report the disclosure in a supportive way
ga: • Ní cóir don mhúinteoir nó don duine den fhoireann ariamh rúndacht a gheallúint do dhuine a dhéanann nochtadh agus ba chóir dó/di a mhíniú cén fáth go gcaithfidh siad an nochtadh a thuairisciú ar mhodh tacúil

source: • The discussion should be recorded accurately and the record should be kept
ga: • Ba chóir an phlé a thaifeadadh go cruinn agus ba chóir an taifead a choinneáil

source: • The teacher or other staff member should then tell the Designated Liasion Person who is responsible for reporting the matter to the Child and Family Agency (Tusla) or An Garda Síochána
ga: • Ba chóir don mhúinteoir nó don duine eile den fhoireann an t-ábhar a chur in iúl don Duine Caidrimh Ainmnithe atá freagrach as an ábhar a thuairisciú don oifig áitiúil atá ag An Ghníomhaireacht um Leanaí agus an Teaghlach nó don Gharda Síochána

source: Under Section 4 of the Protection for Persons Reporting Child Abuse Act, 1998, nobody will be penalised for making a report of child abuse in good faith to the Child and Family Agency or the Gardaí
ga: Faoi Alt 4 den Acht um Chosaintí do Dhaoine a Thuairisceoidh Drochúsáid Leanaí 1998, ní dhéanfar aon duine a phionósú mar gheall ar mhí-úsáid leanaí a thuairisciú de mheon macánta do Ghníomhaireacht um Leanaí agus an Teaghlach nó do na Gardaí

source: If you have been penalised, you can make a complaint under the Protection for Persons Reporting Child Abuse Act 1998 (pdf)
ga: Má ghearradh pionós ort, féadfaidh tú gearán a dhéanamh faoin Acht um Chosaint do Dhaoine a Thuairisceoidh Drochúsáid Leanaí‚ 1998 (pdf)

source: Contact the Child and Family Agency to report a concern
ga: Déan teagmháil leis an Ghníomhaireacht um Leanaí agus an Teaghlach

source: The Irish Society for the Prevention of Cruelty to Children (ISPCC) operates the Childline service - a telephone listening service for children
ga: Oibríonn Cumann na hÉireann um Chosaint Leanaí (CÉCL) Seirbhís Líne Chabhrach na Leanaí seirbhís éisteachta teileafóin do leanaí

source: Childline is provided free of charge 24 hours per day, all year round
ga: Soláthraítear Líne Chabhrach na Leanaí saor in aisce 24 huaire an chloig gach lá i rith na bliana go léir
